CUsersHYPERPCDocuments1CDemoConversion1/src/Catalogs/ПроектныеРешения/ПроектныеРешения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПроектныеРешения</name>
  <basedOn>Catalog.Требования</basedOn>
  <owners>Catalog.Требования</owners>
  <attributes>
    <name>ОбъектФормата</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СвойствоФормата</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Операция</name>
    <type>
      <types>EnumRef.ОперацииСОбъектамиСвойствамиФормата</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеИзменений</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Предварительное</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

CUsersHYPERPCDocuments1CDemoConversion1/src/Catalogs/ПроектныеРешения/ManagerModule.bsl
#Область ОбработчикиСобытий
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Попытка
		Представление = "Объект: " + Данные.Ссылка.ОбъектФормата
			+ ?(ЗначениеЗаполнено(Данные.Ссылка.СвойствоФормата), "; Свойство: " + Данные.Ссылка.СвойствоФормата, "")
			+ "; " + Данные.Ссылка.Операция 
			+ ?(ЗначениеЗаполнено(Данные.Ссылка.ОписаниеИзменений), ": " + Данные.Ссылка.ОписаниеИзменений, "");
	Исключение
		Представление = "";
	КонецПопытки;
	
КонецПроцедуры
#КонецОбласти
